app/controllers/application_controller.rb

  def current_landlord
    @current_landlord ||= Landlord.find(session[:landlord_id]) if session[:landlord_id]
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]