app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    issues = Issue.all

SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    issue = Issue.find(params[:id])

SELECT "issues".* FROM "issues" WHERE "issues"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "issues" SET "isCompleted" = $1, "updated_at" = $2 WHERE "issues"."id" = $3  [["isCompleted", true], ["updated_at", "2020-04-16 21:01:20.265197"], ["id", 1]]
---
  def update
    issue = Issue.find(params[:id])
    issue.update(isCompleted: params[:isCompleted])