app/controllers/landlords_controller.rb

  def index
    @landlords = Landlord.all
---
SELECT "landlords".* FROM "landlords"

def show
  @landlord = Landlord.find(params[:id])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

def create
  @landlord = Landlord.new(landlord_params)
  if @landlord.save
---
INSERT INTO "landlords" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"