app/controllers/properties_controller.rb

    def create
        @property = Property.new(property_params)
        if @property.save
---
INSERT INTO "properties" ("address", "landlord_id", "rooms", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["address", "dasdasdasdas"], ["landlord_id", 1], ["rooms", 3], ["created_at", "2020-04-12 20:45:23.287493"], ["updated_at", "2020-04-12 20:45:23.287493"]]

    def show
      property = Property.find(params[:id])
---
SELECT "properties".* FROM "properties" WHERE "properties"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]