app/controllers/sessions_controller.rb

def create
  @landlord = Landlord.find_by(email: session_params[:email])
---
SELECT "landlords".* FROM "landlords" WHERE "landlords"."email" = $1 LIMIT $2  [["email", "luca@email.com"], ["LIMIT", 1]]