app/controllers/tenants_controller.rb

    def create
        @tenant = Tenant.new(tenant_params)
        if @tenant.save
---
INSERT INTO "tenants" ("first_name", "last_name", "email", "dob", "property_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def index
        @tenants = Tenant.all
---
SELECT "tenants".* FROM "tenants"

    def show
      tenant = Tenant.find(params[:id])
---
SELECT "tenants".* FROM "tenants" WHERE "tenants"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]