app/models/landlord.rb

SELECT "properties".* FROM "properties" WHERE "properties"."landlord_id" = $1  [["landlord_id", 1]]
---
def all_issues
  self.properties.map{|p|p.issues}